basics.org
* Документ

#+BEGIN_HTML
  <p class="verse">
  Я хочу сделать документ в котором будет список того, что мы прошли.<br  />
  Что то вроде версии электронного конспекта, который будет пополняться.<br  />
  </p>

#+END_HTML

Формат такой:

-  Тебе:

   -  Просмотреть материал\\
   -  Понять (то что получается)\\
   -  Подготовить вопросы\\

-  Мне:

   -  Найти материал\\
   -  Проработать его самим\\
   -  Объяснить тебе

* Home Work
* HomeWork

[[https://commotionwireless.net/docs/cck/networking/learn-networking-basics/][Learn
Networking Basics]]

Здесь нужно разобраться с главами /Clients and Servers/, /IP Addresses/.

/Network Hubs/ and /Switches, Routers and Firewalls/ просто для
прочтения.

[[https://www.youtube.com/watch?v=xpXhudbsrr8][Networking Tutorials for
Beginners]]

К видео есть описание. Попробовать столько глав сколько получится.

Термины на которые стоит обратить внимание:

-  Client\\
-  Server\\
-  IP address\\
-  TCP and UDP ports\\
-  Hub\\
-  Switch\\
-  Router

Подготовить вопросы.


* Network Basics
** MAC addr
[[https://en.wikipedia.org/wiki/MAC_address][wiki]]
#+begin_verse
A *media access control address* (MAC address) of a computer is a unique identifier assigned to network interfaces for communications at the data link layer of a network segment.

On broadcast networks, such as Ethernet, the MAC address uniquely identifies each node on that segment and allows frames to be marked for specific hosts. It thus forms the basis of most of the link layer (OSI Layer 2) networking upon which upper layer protocols rely to produce complex, functioning networks. 

#+end_verse

** IP addr

** Network hardware
*** NIC
*** Hub
*** Switch
*** Router


* Some Terms
** Kernel

[[https://en.wikipedia.org/wiki/Kernel_(operating_system)][wiki]]

#+BEGIN_HTML
  <p class="verse">
  <strong>Kernel</strong> the central component of most operating systems.<br  />
  The kernel is a computer program that constitutes the central core of a computer's operating system. It has complete control over everything that occurs in the system. As such, it is the first program loaded on startup, and then manages the remainder of the startup, as well as input/output requests from software, translating them into data processing instructions for the central processing unit. It is also responsible for managing memory, and for managing and communicating with computing peripherals, like printers, speakers, etc.<br  />
  The kernel is a fundamental part of a modern computer's operating system.<br  />
  </p>

#+END_HTML

** GUI

[[https://en.wikipedia.org/wiki/Graphical_user_interface][wiki]]

#+BEGIN_HTML
  <p class="verse">
  In computer science, a graphical user interface (<strong>GUI</strong>), is a type of user interface that allows users to interact with electronic devices through graphical icons and visual indicators such as secondary notation, instead of text-based user interfaces, typed command labels or text navigation. GUIs were introduced in reaction to the perceived steep learning curve of command-line interfaces (CLIs) which require commands to be typed on a computer keyboard.<br  />
  </p>

#+END_HTML

** API

*** Purpose

[[https://en.wikipedia.org/wiki/Application_programming_interface][wiki]]

#+BEGIN_HTML
  <p class="verse">
  Just as a graphical user interface (<strong>GUI</strong>) makes it easier for people to use programs, application programming interfaces (<strong>API</strong>) make it easier for developers to use certain technologies in building applications. By abstracting the underlying implementation and only exposing objects or actions the developer needs, an API reduces the cognitive load on a programmer. While a graphical interface for an email client might provide a user with a button that performs all the steps for fetching and highlighting new emails, an API for file input/output might give the developer a function that copies a file from one location to another without requiring that the developer understand the file system operations occurring behind the scenes.<br  />
  </p>


#+END_HTML

