basics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-08-22 Mon 23:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Документ</a></li>
<li><a href="#orgheadline2">2. Home Work</a></li>
<li><a href="#orgheadline3">3. HomeWork</a></li>
<li><a href="#orgheadline11">4. Network Basics</a>
<ul>
<li><a href="#orgheadline4">4.1. MAC addr</a></li>
<li><a href="#orgheadline5">4.2. IP addr</a></li>
<li><a href="#orgheadline10">4.3. Network hardware</a>
<ul>
<li><a href="#orgheadline6">4.3.1. NIC</a></li>
<li><a href="#orgheadline7">4.3.2. Hub</a></li>
<li><a href="#orgheadline8">4.3.3. Switch</a></li>
<li><a href="#orgheadline9">4.3.4. Router</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline16">5. Some Terms</a>
<ul>
<li><a href="#orgheadline12">5.1. Kernel</a></li>
<li><a href="#orgheadline13">5.2. GUI</a></li>
<li><a href="#orgheadline15">5.3. API</a>
<ul>
<li><a href="#orgheadline14">5.3.1. Purpose</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Документ</h2>
<div class="outline-text-2" id="text-1">
<p class="verse">
Я хочу сделать документ в котором будет список того, что мы прошли.<br  />
Что то вроде версии электронного конспекта, который будет пополняться.<br  />
</p>

<p>
Формат такой:
</p>

<ul class="org-ul">
<li>Тебе:

<ul class="org-ul">
<li>Просмотреть материал<br  /></li>
<li>Понять (то что получается)<br  /></li>
<li>Подготовить вопросы<br  /></li>
</ul></li>

<li>Мне:

<ul class="org-ul">
<li>Найти материал<br  /></li>
<li>Проработать его самим<br  /></li>
<li>Объяснить тебе</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Home Work</h2>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> HomeWork</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://commotionwireless.net/docs/cck/networking/learn-networking-basics/">Learn
Networking Basics</a>
</p>

<p>
Здесь нужно разобраться с главами <i>Clients and Servers</i>, <i>IP Addresses</i>.
</p>

<p>
<i>Network Hubs</i> and <i>Switches, Routers and Firewalls</i> просто для
прочтения.
</p>

<p>
<a href="https://www.youtube.com/watch?v=xpXhudbsrr8">Networking Tutorials for
Beginners</a>
</p>

<p>
К видео есть описание. Попробовать столько глав сколько получится.
</p>

<p>
Термины на которые стоит обратить внимание:
</p>

<ul class="org-ul">
<li>Client<br  /></li>
<li>Server<br  /></li>
<li>IP address<br  /></li>
<li>TCP and UDP ports<br  /></li>
<li>Hub<br  /></li>
<li>Switch<br  /></li>
<li>Router</li>
</ul>

<p>
Подготовить вопросы.
</p>
</div>
</div>


<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">4</span> Network Basics</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">4.1</span> MAC addr</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<a href="https://en.wikipedia.org/wiki/MAC_address">wiki</a>
</p>
<p class="verse">
A <b>media access control address</b> (MAC address) of a computer is a unique identifier assigned to network interfaces for communications at the data link layer of a network segment.<br  />
<br  />
On broadcast networks, such as Ethernet, the MAC address uniquely identifies each node on that segment and allows frames to be marked for specific hosts. It thus forms the basis of most of the link layer (OSI Layer 2) networking upon which upper layer protocols rely to produce complex, functioning networks.<br  />
<br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">4.2</span> IP addr</h3>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">4.3</span> Network hardware</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">4.3.1</span> NIC</h4>
</div>
<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><span class="section-number-4">4.3.2</span> Hub</h4>
</div>
<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="section-number-4">4.3.3</span> Switch</h4>
</div>
<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">4.3.4</span> Router</h4>
</div>
</div>
</div>


<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">5</span> Some Terms</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">5.1</span> Kernel</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<a href="https://en.wikipedia.org/wiki/Kernel_(operating_system)">wiki</a>
</p>

<p class="verse">
<strong>Kernel</strong> the central component of most operating systems.<br  />
The kernel is a computer program that constitutes the central core of a computer's operating system. It has complete control over everything that occurs in the system. As such, it is the first program loaded on startup, and then manages the remainder of the startup, as well as input/output requests from software, translating them into data processing instructions for the central processing unit. It is also responsible for managing memory, and for managing and communicating with computing peripherals, like printers, speakers, etc.<br  />
The kernel is a fundamental part of a modern computer's operating system.<br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">5.2</span> GUI</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<a href="https://en.wikipedia.org/wiki/Graphical_user_interface">wiki</a>
</p>

<p class="verse">
In computer science, a graphical user interface (<strong>GUI</strong>), is a type of user interface that allows users to interact with electronic devices through graphical icons and visual indicators such as secondary notation, instead of text-based user interfaces, typed command labels or text navigation. GUIs were introduced in reaction to the perceived steep learning curve of command-line interfaces (CLIs) which require commands to be typed on a computer keyboard.<br  />
</p>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">5.3</span> API</h3>
<div class="outline-text-3" id="text-5-3">
</div><div id="outline-container-orgheadline14" class="outline-4">
<h4 id="orgheadline14"><span class="section-number-4">5.3.1</span> Purpose</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
<a href="https://en.wikipedia.org/wiki/Application_programming_interface">wiki</a>
</p>

<p class="verse">
Just as a graphical user interface (<strong>GUI</strong>) makes it easier for people to use programs, application programming interfaces (<strong>API</strong>) make it easier for developers to use certain technologies in building applications. By abstracting the underlying implementation and only exposing objects or actions the developer needs, an API reduces the cognitive load on a programmer. While a graphical interface for an email client might provide a user with a button that performs all the steps for fetching and highlighting new emails, an API for file input/output might give the developer a function that copies a file from one location to another without requiring that the developer understand the file system operations occurring behind the scenes.<br  />
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-08-22 Mon 23:49</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
