basics.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Документ</a></li>
<li><a href="#orgheadline2">2. Home Work</a></li>
<li><a href="#orgheadline3">3. HomeWork</a></li>
<li><a href="#orgheadline11">4. Network Basics</a>
<ul>
<li><a href="#orgheadline4">4.1. MAC addr</a></li>
<li><a href="#orgheadline5">4.2. IP addr</a></li>
<li><a href="#orgheadline10">4.3. Network hardware</a>
<ul>
<li><a href="#orgheadline6">4.3.1. NIC</a></li>
<li><a href="#orgheadline7">4.3.2. Hub</a></li>
<li><a href="#orgheadline8">4.3.3. Switch</a></li>
<li><a href="#orgheadline9">4.3.4. Router</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline16">5. Some Terms</a>
<ul>
<li><a href="#orgheadline12">5.1. Kernel</a></li>
<li><a href="#orgheadline13">5.2. GUI</a></li>
<li><a href="#orgheadline15">5.3. API</a>
<ul>
<li><a href="#orgheadline14">5.3.1. Purpose</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

# Документ<a id="orgheadline1"></a>

<p class="verse">
Я хочу сделать документ в котором будет список того, что мы прошли.<br  />
Что то вроде версии электронного конспекта, который будет пополняться.<br  />
</p>

Формат такой:

-   Тебе:
    -   Просмотреть материал
    -   Понять (то что получается)
    -   Подготовить вопросы

-   Мне:
    -   Найти материал
    -   Проработать его самим
    -   Объяснить тебе

# Home Work<a id="orgheadline2"></a>

# HomeWork<a id="orgheadline3"></a>

[Learn
Networking Basics](https://commotionwireless.net/docs/cck/networking/learn-networking-basics/)

Здесь нужно разобраться с главами *Clients and Servers*, *IP Addresses*.

*Network Hubs* and *Switches, Routers and Firewalls* просто для
прочтения.

[Networking Tutorials for
Beginners](https://www.youtube.com/watch?v=xpXhudbsrr8)

К видео есть описание. Попробовать столько глав сколько получится.

Термины на которые стоит обратить внимание:

-   Client
-   Server
-   IP address
-   TCP and UDP ports
-   Hub
-   Switch
-   Router

Подготовить вопросы.

# Network Basics<a id="orgheadline11"></a>

## MAC addr<a id="orgheadline4"></a>

[wiki](https://en.wikipedia.org/wiki/MAC_address)

<p class="verse">
A **media access control address** (MAC address) of a computer is a unique identifier assigned to network interfaces for communications at the data link layer of a network segment.<br  />
<br  />
On broadcast networks, such as Ethernet, the MAC address uniquely identifies each node on that segment and allows frames to be marked for specific hosts. It thus forms the basis of most of the link layer (OSI Layer 2) networking upon which upper layer protocols rely to produce complex, functioning networks.<br  />
<br  />
</p>

## IP addr<a id="orgheadline5"></a>

## Network hardware<a id="orgheadline10"></a>

### NIC<a id="orgheadline6"></a>

### Hub<a id="orgheadline7"></a>

### Switch<a id="orgheadline8"></a>

### Router<a id="orgheadline9"></a>

# Some Terms<a id="orgheadline16"></a>

## Kernel<a id="orgheadline12"></a>

[wiki](https://en.wikipedia.org/wiki/Kernel_(operating_system))

<p class="verse">
<strong>Kernel</strong> the central component of most operating systems.<br  />
The kernel is a computer program that constitutes the central core of a computer's operating system. It has complete control over everything that occurs in the system. As such, it is the first program loaded on startup, and then manages the remainder of the startup, as well as input/output requests from software, translating them into data processing instructions for the central processing unit. It is also responsible for managing memory, and for managing and communicating with computing peripherals, like printers, speakers, etc.<br  />
The kernel is a fundamental part of a modern computer's operating system.<br  />
</p>

## GUI<a id="orgheadline13"></a>

[wiki](https://en.wikipedia.org/wiki/Graphical_user_interface)

<p class="verse">
In computer science, a graphical user interface (<strong>GUI</strong>), is a type of user interface that allows users to interact with electronic devices through graphical icons and visual indicators such as secondary notation, instead of text-based user interfaces, typed command labels or text navigation. GUIs were introduced in reaction to the perceived steep learning curve of command-line interfaces (CLIs) which require commands to be typed on a computer keyboard.<br  />
</p>

## API<a id="orgheadline15"></a>

### Purpose<a id="orgheadline14"></a>

[wiki](https://en.wikipedia.org/wiki/Application_programming_interface)

<p class="verse">
Just as a graphical user interface (<strong>GUI</strong>) makes it easier for people to use programs, application programming interfaces (<strong>API</strong>) make it easier for developers to use certain technologies in building applications. By abstracting the underlying implementation and only exposing objects or actions the developer needs, an API reduces the cognitive load on a programmer. While a graphical interface for an email client might provide a user with a button that performs all the steps for fetching and highlighting new emails, an API for file input/output might give the developer a function that copies a file from one location to another without requiring that the developer understand the file system operations occurring behind the scenes.<br  />
</p>